SoapRequestGiftActivate

 <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ActivateCardKeyed xmlns="http://schemas.merchantwarehouse.com/merchantware/40/Giftcard">
			<merchantName>abc</merchantName>
			<merchantSiteId>123</merchantSiteId>
			<merchantKey>abc123</merchantKey>
			<invoiceNumber>34</invoiceNumber>
			<amount>5.15</amount>
			<cardNumber>123456789012345</cardNumber>
			<extraData>Clerk_Id=20;Ticket=Ticket100</extraData>
		</ActivateCardKeyed>
	</soap:Body>
</soap:Envelope>

